{"class_name": "Sequential", "keras_version": "2.2.4", "config": {"name": "sequential_1", "layers": [{"class_name": "Conv2D", "config": {"kernel_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "data_format": "channels_last", "activation": "relu", "dilation_rate": [1, 1], "kernel_size": [3, 3], "bias_regularizer": null, "dtype": "float32", "trainable": true, "padding": "same", "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "seed": null, "stddev": 0.01}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "batch_input_shape": [null, null, null, 3], "bias_constraint": null, "name": "conv2d_1", "activity_regularizer": null, "filters": 64, "use_bias": true}}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "data_format": "channels_last", "activation": "relu", "dilation_rate": [1, 1], "kernel_size": [3, 3], "bias_regularizer": null, "trainable": true, "padding": "same", "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "seed": null, "stddev": 0.01}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "bias_constraint": null, "name": "conv2d_2", "activity_regularizer": null, "use_bias": true}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_1", "padding": "valid", "pool_size": [2, 2], "trainable": true}}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "data_format": "channels_last", "activation": "relu", "dilation_rate": [1, 1], "kernel_size": [3, 3], "bias_regularizer": null, "trainable": true, "padding": "same", "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "seed": null, "stddev": 0.01}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 128, "bias_constraint": null, "name": "conv2d_3", "activity_regularizer": null, "use_bias": true}}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "data_format": "channels_last", "activation": "relu", "dilation_rate": [1, 1], "kernel_size": [3, 3], "bias_regularizer": null, "trainable": true, "padding": "same", "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "seed": null, "stddev": 0.01}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 128, "bias_constraint": null, "name": "conv2d_4", "activity_regularizer": null, "use_bias": true}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_2", "padding": "valid", "pool_size": [2, 2], "trainable": true}}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "data_format": "channels_last", "activation": "relu", "dilation_rate": [1, 1], "kernel_size": [3, 3], "bias_regularizer": null, "trainable": true, "padding": "same", "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "seed": null, "stddev": 0.01}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 256, "bias_constraint": null, "name": "conv2d_5", "activity_regularizer": null, "use_bias": true}}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "data_format": "channels_last", "activation": "relu", "dilation_rate": [1, 1], "kernel_size": [3, 3], "bias_regularizer": null, "trainable": true, "padding": "same", "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "seed": null, "stddev": 0.01}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 256, "bias_constraint": null, "name": "conv2d_6", "activity_regularizer": null, "use_bias": true}}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "data_format": "channels_last", "activation": "relu", "dilation_rate": [1, 1], "kernel_size": [3, 3], "bias_regularizer": null, "trainable": true, "padding": "same", "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "seed": null, "stddev": 0.01}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 256, "bias_constraint": null, "name": "conv2d_7", "activity_regularizer": null, "use_bias": true}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_3", "padding": "valid", "pool_size": [2, 2], "trainable": true}}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "data_format": "channels_last", "activation": "relu", "dilation_rate": [1, 1], "kernel_size": [3, 3], "bias_regularizer": null, "trainable": true, "padding": "same", "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "seed": null, "stddev": 0.01}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 512, "bias_constraint": null, "name": "conv2d_8", "activity_regularizer": null, "use_bias": true}}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "data_format": "channels_last", "activation": "relu", "dilation_rate": [1, 1], "kernel_size": [3, 3], "bias_regularizer": null, "trainable": true, "padding": "same", "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "seed": null, "stddev": 0.01}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 512, "bias_constraint": null, "name": "conv2d_9", "activity_regularizer": null, "use_bias": true}}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "data_format": "channels_last", "activation": "relu", "dilation_rate": [1, 1], "kernel_size": [3, 3], "bias_regularizer": null, "trainable": true, "padding": "same", "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "seed": null, "stddev": 0.01}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 512, "bias_constraint": null, "name": "conv2d_10", "activity_regularizer": null, "use_bias": true}}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "data_format": "channels_last", "activation": "relu", "dilation_rate": [2, 2], "kernel_size": [3, 3], "bias_regularizer": null, "trainable": true, "padding": "same", "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "seed": null, "stddev": 0.01}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 512, "bias_constraint": null, "name": "conv2d_11", "activity_regularizer": null, "use_bias": true}}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "data_format": "channels_last", "activation": "relu", "dilation_rate": [2, 2], "kernel_size": [3, 3], "bias_regularizer": null, "trainable": true, "padding": "same", "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "seed": null, "stddev": 0.01}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 512, "bias_constraint": null, "name": "conv2d_12", "activity_regularizer": null, "use_bias": true}}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "data_format": "channels_last", "activation": "relu", "dilation_rate": [2, 2], "kernel_size": [3, 3], "bias_regularizer": null, "trainable": true, "padding": "same", "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "seed": null, "stddev": 0.01}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 512, "bias_constraint": null, "name": "conv2d_13", "activity_regularizer": null, "use_bias": true}}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "data_format": "channels_last", "activation": "relu", "dilation_rate": [2, 2], "kernel_size": [3, 3], "bias_regularizer": null, "trainable": true, "padding": "same", "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "seed": null, "stddev": 0.01}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 256, "bias_constraint": null, "name": "conv2d_14", "activity_regularizer": null, "use_bias": true}}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "data_format": "channels_last", "activation": "relu", "dilation_rate": [2, 2], "kernel_size": [3, 3], "bias_regularizer": null, "trainable": true, "padding": "same", "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "seed": null, "stddev": 0.01}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 128, "bias_constraint": null, "name": "conv2d_15", "activity_regularizer": null, "use_bias": true}}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "data_format": "channels_last", "activation": "relu", "dilation_rate": [2, 2], "kernel_size": [3, 3], "bias_regularizer": null, "trainable": true, "padding": "same", "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "seed": null, "stddev": 0.01}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "bias_constraint": null, "name": "conv2d_16", "activity_regularizer": null, "use_bias": true}}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "data_format": "channels_last", "activation": "relu", "dilation_rate": [1, 1], "kernel_size": [1, 1], "bias_regularizer": null, "trainable": true, "padding": "same", "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "seed": null, "stddev": 0.01}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 1, "bias_constraint": null, "name": "conv2d_17", "activity_regularizer": null, "use_bias": true}}]}, "backend": "tensorflow"}